# 06 - Combining datasets

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np 
import pandas as pd 
import random

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
first = np.random.randint(1,4,100)
second = np.random.randint(1,3,100)
third = np.random.randint(10000,30000,100)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df = pd.DataFrame([first, second, third], index=["a","b","c"])
df = df.T
df

    a  b      c
0   3  2  25819
1   3  2  25982
2   2  2  11609
3   1  2  19726
4   2  2  13326
.. .. ..    ...
95  3  1  20712
96  2  1  12836
97  2  1  12330
98  2  1  24108
99  2  1  18781

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df = df.rename(columns = {"a":"bedrs", "b": "bathrs", "c":"price_sqr_meter"})
df

    bedrs  bathrs  price_sqr_meter
0       3       2            25819
1       3       2            25982
2       2       2            11609
3       1       2            19726
4       2       2            13326
..    ...     ...              ...
95      3       1            20712
96      2       1            12836
97      2       1            12330
98      2       1            24108
99      2       1            18781

[100 rows x 3 columns]

### Step 5. Create a column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [44]:
bigcolumn = pd.concat([first,second,third],axis=0)
bigcolumn

TypeError: cannot concatenate object of type '<class 'numpy.ndarray'>'; only Series and DataFrame objs are valid

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
len(bigcolumn)

4

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [20]:
df.set_index=range(1,300)
df

    bedrs  bathrs  price_sqr_meter  bigcolumn
0       3       2            25819    25824.0
1       3       2            25982    25987.0
2       2       2            11609    11613.0
3       1       2            19726    19729.0
4       2       2            13326    13330.0
..    ...     ...              ...        ...
95      3       1            20712    20716.0
96      2       1            12836    12839.0
97      2       1            12330    12333.0
98      2       1            24108    24111.0
99      2       1            18781    18784.0

[100 rows x 4 columns]